In [2]:
import pandas as pd

Load data set

In [38]:
df = pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

Getting information from data

In [29]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1337.000000
mean     39.207025    30.663397     1.094918  13278.973638
std      14.049960     6.098187     1.205493  12110.500655
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4746.344000
50%      39.000000    30.400000     1.000000   9386.161300
75%      51.000000    34.693750     2.000000  16657.717450
max      64.000000    53.130000     5.000000  63770.428010

get the data types from every column

In [30]:
df.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

Checking the null value

it returns true if there is any missing value

In [39]:
df.isnull().any()

age         False
sex         False
bmi         False
children    False
smoker      False
region      False
charges      True
dtype: bool

In [31]:
df.isnull()

        age    sex    bmi  children  smoker  region  charges
0     False  False  False     False   False   False    False
1     False  False  False     False   False   False    False
2     False  False  False     False   False   False    False
3     False  False  False     False   False   False    False
4     False  False  False     False   False   False    False
...     ...    ...    ...       ...     ...     ...      ...
1333  False  False  False     False   False   False    False
1334  False  False  False     False   False   False    False
1335  False  False  False     False   False   False    False
1336  False  False  False     False   False   False    False
1337  False  False  False     False   False   False    False

[1338 rows x 7 columns]

get the total count, how many values are missing according to the column

In [32]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     1
dtype: int64

set null value to mean

In [33]:
df.charges = df.charges.fillna(df.charges.mean())
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

Fill nan value from the cell above
the fillna() operation is not inplace. to do so use <code>inplace = True</code>

In [35]:
# Sample DataFrame
dff = pd.DataFrame({
    'A': [1, None, None, 4],
    'B': [None, 2, None, 4]
})

# Replace NaN with the value from the cell above
dff.fillna(method='ffill', inplace=True)

print(dff)

     A    B
0  1.0  NaN
1  1.0  2.0
2  1.0  2.0
3  4.0  4.0

C:\Users\USERAS\AppData\Local\Temp\ipykernel_3992\2416823492.py:8: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  dff.fillna(method='ffill', inplace=True)

fill from upper cell

In [36]:
dff.ffill()

     A    B
0  1.0  NaN
1  1.0  2.0
2  1.0  2.0
3  4.0  4.0

fill form lower cell

In [37]:
dff.bfill()

     A    B
0  1.0  2.0
1  1.0  2.0
2  1.0  2.0
3  4.0  4.0

Rename a col name

In [40]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [43]:
df = df.rename(columns={'sex':'gender'})
df

      age  gender     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

Changing the data types

In [44]:
df.dtypes

age           int64
gender       object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [45]:
df['infants'] = df['children'].astype('float')
df.head()

   age  gender     bmi  children smoker     region      charges  infants
0   19  female  27.900         0    yes  southwest  16884.92400      0.0
1   18    male  33.770         1     no  southeast   1725.55230      1.0
2   28    male  33.000         3     no  southeast   4449.46200      3.0
3   33    male  22.705         0     no  northwest  21984.47061      0.0
4   32    male  28.880         0     no  northwest   3866.85520      0.0

Apply custom rule or function

In [46]:
df.infants = df.infants.apply(lambda x: x**2)
df.head()

   age  gender     bmi  children smoker     region      charges  infants
0   19  female  27.900         0    yes  southwest  16884.92400      0.0
1   18    male  33.770         1     no  southeast   1725.55230      1.0
2   28    male  33.000         3     no  southeast   4449.46200      9.0
3   33    male  22.705         0     no  northwest  21984.47061      0.0
4   32    male  28.880         0     no  northwest   3866.85520      0.0

Data aggregation and grouping

<i>get the children count based on gender</i>

In [51]:
gender_groupby = df.groupby('gender')['children'].count()
gender_groupby

gender
female    662
male      676
Name: children, dtype: int64

<i>get the childern of smoker vs non smoker</i>

In [52]:
smoker_groupby = df.groupby('smoker')['children'].count()
smoker_groupby

smoker
no     1064
yes     274
Name: children, dtype: int64

apply mean function

In [53]:
smoker_groupby = df.groupby('smoker')['children'].mean()
smoker_groupby

smoker
no     1.090226
yes    1.113139
Name: children, dtype: float64

<i>get charges based on smoker and region</i>

In [55]:
smoker_groupby = df.groupby(['smoker','region'])['charges'].sum()
smoker_groupby

smoker  region
no      northeast    2.355542e+06
        northwest    2.284576e+06
        southeast    2.192795e+06
        southwest    2.139312e+06
yes     northeast    1.988127e+06
        northwest    1.751136e+06
        southeast    3.170895e+06
        southwest    1.871606e+06
Name: charges, dtype: float64

apply multiple aggregate functions

In [56]:
smoker_groupby = df.groupby(['smoker','region'])['charges'].agg(['mean', 'max', 'min']) 
smoker_groupby

                          mean          max         min
smoker region
no     northeast   9165.531672  32108.66282   1694.7964
       northwest   8556.463715  33471.97189   1621.3402
       southeast   8032.216309  36580.28216   1121.8739
       southwest   8042.525293  36910.60803   1241.5650
yes    northeast  29673.536473  58571.07448  12829.4551
       northwest  30192.003182  60021.39897  14711.7438
       southeast  34844.996824  63770.42801  16577.7795
       southwest  32269.063494  52590.82939  13844.5060

# Joining and Merging